reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
bool TofBringUp() {
    g_tof.setBus(&Wire);
    g_tof.setTimeout(500);
    g_tof.setAddress(I2CAddr::VL53L1X);

    if (!g_tof.init()) return false;

    g_tof.setDistanceMode(VL53L1X::Long);
    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
    return true;
}

void TofSensorTask(void *) {
    digitalWrite(Pins::TOF_XSHUT, HIGH);
    delay(Tof::BOOT_DELAY_MS);

    // TofBringUp() incluye la reasignación de dirección del VL53L1X (ver la
    // nota larga en I2CAddr::VL53L1X_BOOT_ADDR): esa escritura ocurre
    // mientras el chip todavía responde en 0x29, la MISMA dirección del
    // TCS34725 delantero. Antes esto era "un riesgo acotado y aceptado";
    // con el mutex del bus (ver g_i2c0Mutex) deja de ser un riesgo: mientras
    // se sostiene el lock, ColorSensorTask no puede tocar el bus, así que
    // las dos direcciones nunca coinciden con dos transacciones activas a
    // la vez.
    bool tof_ok = false;
    if (I2c0Lock()) {
        tof_ok = TofBringUp();
        I2c0Unlock();
    }
    if (!tof_ok) {
        DEBUG_LINK.println("[ToF] VL53L1X no responde. Reintentando en segundo plano.");
    }

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::TOF_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        if (!tof_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c0Lock()) {
                tof_ok = g_tof.init();
                if (tof_ok) {
                    g_tof.setDistanceMode(VL53L1X::Long);
                    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
                    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
                }
                I2c0Unlock();
            }
        }

        TofReading reading;
        reading.timestamp_ms = millis();

        if (tof_ok && I2c0Lock()) {
            if (g_tof.dataReady()) {
                reading.distance_mm = g_tof.read(false);
                reading.valid = !g_tof.timeoutOccurred() &&
                                g_tof.ranging_data.range_status == VL53L1X::RangeValid;
                if (g_tof.timeoutOccurred()) tof_ok = false;
            }
            I2c0Unlock();
        }

        PushDropOldest(g_tofQueue, reading);

        Heartbeat(TaskId::TOF_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.4  ColorSensorTask — TCS34725 delantero (Wire) y trasero (Wire1)
// ---------------------------------------------------------------------------

void ColorSensorTask(void *) {
    pinMode(Pins::TCS_LED_FRONT, OUTPUT);
    digitalWrite(Pins::TCS_LED_FRONT, HIGH);

    // El sensor DELANTERO vive en Wire (bus I2C nº0), el mismo que el
    // PCA9685 y el VL53L1X: sus llamadas van protegidas por g_i2c0Mutex
    // (ver la nota larga junto a su declaración). El TRASERO vive solo en
    // Wire1 (bus nº1): nadie más lo toca, así que no necesita el mutex.
    bool front_ok = false;
    if (I2c0Lock()) {
        front_ok = Tcs34725::Init(Wire);
        I2c0Unlock();
    }
    bool back_ok = Tcs34725::Init(Wire1);

    if (!front_ok) DEBUG_LINK.println("[Color] sensor DELANTERO no responde (bus I2C 0).");
    if (!back_ok)  DEBUG_LINK.println("[Color] sensor TRASERO no responde (bus I2C 1).");

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::COLOR_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        if ((!front_ok || !back_ok) && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (!front_ok && I2c0Lock()) {
                front_ok = Tcs34725::Init(Wire);
                I2c0Unlock();
            }
            if (!back_ok) back_ok = Tcs34725::Init(Wire1);
        }

        ColorReading reading;
        reading.timestamp_ms = millis();

        Tcs34725::Rgbc sample;
        if (front_ok) {
            bool read_ok = false;
            if (I2c0Lock()) {
                read_ok = Tcs34725::Read(Wire, sample);
                I2c0Unlock();
            }
            if (read_ok) {
                reading.front = ClassifyColor(sample);
                reading.front_valid = true;
            } else {
                front_ok = false;
            }
        }

        if (back_ok && Tcs34725::Read(Wire1, sample)) {
            reading.back = ClassifyColor(sample);
            reading.back_valid = true;
        } else {
            back_ok = false;
        }

        PushDropOldest(g_colorQueue, reading);

        Heartbeat(TaskId::COLOR_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  ReflectanceTask — 2x QTRX-HD-01A
// ---------------------------------------------------------------------------
//  Valor ADC ALTO = superficie OSCURA (cinta negra del borde). Ver la nota
//  larga en firmware-esp32/src/main.cpp si esto no es intuitivo.

constexpr uint16_t kDarkThreshold = 2048;   // TODO: calibrar en la pista real

void ReflectanceTask(void *) {
    analogReadResolution(12);
    analogSetPinAttenuation(Pins::QTR_LEFT_OUT, ADC_11db);
    analogSetPinAttenuation(Pins::QTR_RIGHT_OUT, ADC_11db);

    pinMode(Pins::QTR_EMITTER_CTRL, OUTPUT);
    digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::REFLECTANCE);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        ReflectanceReading reading;
        reading.timestamp_ms  = millis();
        reading.left_raw      = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        reading.right_raw     = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);
        reading.left_on_line  = reading.left_raw  > kDarkThreshold;
        reading.right_on_line = reading.right_raw > kDarkThreshold;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.6  LedTask — LED RGB: indicador puro de la línea/zona de piso
// ---------------------------------------------------------------------------
//  Único trabajo del LED en esta variante: decir sobre qué está parado el
//  robot AHORA MISMO, nada más — ni equipo, ni "veo la bandera".
//    · Piso gris (FLOOR) o sin lectura válida -> apagado.
//    · Amarillo / rojo / azul                 -> ese mismo color, fijo.
//    · Negro (borde)                          -> destello alternando
//                                                 rojo/azul, como alerta.

namespace RgbLed {
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD CONFIRMADA con el LED físico: es CÁTODO COMÚN, o sea duty
    // alto = canal más brillante (mismo caso que firmware-esp32/). La
    // constante se conserva por si algún día se cambia el LED por uno de
    // ánodo común.
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    // Color fijo de las zonas que NO parpadean. BLACK no aparece aquí a
    // propósito: LedTask lo maneja aparte, alternando rojo/azul.
    void ApplyZone(ColorLabel zone) {
        switch (zone) {
            case ColorLabel::YELLOW: SetRaw(255, 170, 0); break;
            case ColorLabel::RED:    SetRaw(255, 0, 0);   break;
            case ColorLabel::BLUE:   SetRaw(0, 0, 255);   break;
            case ColorLabel::BLACK:
            case ColorLabel::FLOOR:
            case ColorLabel::UNKNOWN:
            default:
                SetRaw(0, 0, 0);   // apagado: piso neutro o sin lectura
                break;
        }
    }
}

// Cuántas vueltas de LedTask dura cada mitad del destello rojo/azul sobre
// el borde negro. A TaskPeriodMs::LED_STATUS (100 ms) y 3 vueltas por
// mitad, el ciclo completo dura 600 ms (~1.7 Hz): lo bastante lento para
// distinguir los dos colores a simple vista, no un borrón.
constexpr uint32_t kBorderBlinkHalfPeriodTicks = 3;

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);

