reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
                // -- 10. Misión completa: quieto -----------------------------
                case Mission::Phase::TERMINADO:
                default:
                    break;
            }
        }

        } // if (Mission::kMotionEnabled)

        xQueueOverwrite(g_motorCmdQueue, &motor);
        if (send_gripper) xQueueSend(g_gripperCmdQueue, &gripper, 0);

        LedCommand led;
        led.zone = last_color.front_valid ? last_color.front : ColorLabel::UNKNOWN;
        xQueueOverwrite(g_ledCmdQueue, &led);

        Heartbeat(TaskId::MISSION);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ===========================================================================
//  [10] SUPERVISORTASK, setup() / loop()
// ===========================================================================

namespace {

void SupervisorTask(void *) {
    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::SUPERVISOR);
    TickType_t last_wake = xTaskGetTickCount();

    uint8_t previous_faults = 0;

    for (;;) {
        const uint8_t faulted = WatchdogCheck();

        if (faulted != 0) {
            HealthReport report;
            report.timestamp_ms = millis();
            report.faulted_tasks_bitmask = faulted;
            xQueueOverwrite(g_healthQueue, &report);
        }

        if (faulted != previous_faults) {
            DEBUG_LINK.printf("[Supervisor] tareas colgadas: 0x%02X\n", faulted);
            previous_faults = faulted;
        }

        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo

static bool CreateQueues() {
    g_motorCmdQueue   = xQueueCreate(1, sizeof(MotorCommand));
    g_gripperCmdQueue = xQueueCreate(4, sizeof(GripperCommand));
    g_ledCmdQueue     = xQueueCreate(1, sizeof(LedCommand));
    g_colorQueue      = xQueueCreate(4, sizeof(ColorReading));
    g_reflectQueue    = xQueueCreate(4, sizeof(ReflectanceReading));
    g_tofQueue        = xQueueCreate(4, sizeof(TofReading));
    g_healthQueue     = xQueueCreate(1, sizeof(HealthReport));

    return g_motorCmdQueue && g_gripperCmdQueue && g_ledCmdQueue &&
           g_colorQueue && g_reflectQueue && g_tofQueue && g_healthQueue;
}

constexpr uint32_t SERIAL_BAUD_RATE = 115200;

// Vive fuera de setup() porque MissionTask la recibe por puntero al crear
// la tarea (xTaskCreatePinnedToCore no admite pasar un TeamColor por valor
// directamente): tiene que sobrevivir a setup() retornando.
static TeamColor g_myTeam = TeamColor::BLUE;   // sobrescrito abajo por el switch de equipo

// Traduce el motivo del último reinicio a algo legible. Existe porque el
// USB nativo se reenumera solo con cada reset del ESP32-S3: un monitor
// serial conectado pierde los primeros logs mientras se reconecta, así que
// "¿por qué se reinició?" es justo la pregunta que más se pierde sin este
// mensaje explícito (ver el bloqueo de reconexión más abajo en setup()).
static const char *ResetReasonToString(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_POWERON:   return "POWERON (se energizo desde cero)";
        case ESP_RST_EXT:       return "EXTERNO (pin de reset)";
        case ESP_RST_SW:        return "SOFTWARE (esp_restart() o similar)";
        case ESP_RST_PANIC:     return "PANIC (excepcion/crash del firmware)";
        case ESP_RST_INT_WDT:   return "INTERRUPT WATCHDOG";
        case ESP_RST_TASK_WDT:  return "TASK WATCHDOG (una tarea no volvio a tiempo)";
        case ESP_RST_WDT:       return "OTRO WATCHDOG";
        case ESP_RST_DEEPSLEEP: return "DEEP SLEEP";
        case ESP_RST_BROWNOUT:  return "BROWNOUT: el voltaje cayo debajo del minimo -- revisar bateria/alimentacion";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "DESCONOCIDO";
    }
}

void setup() {
    DEBUG_LINK.begin(SERIAL_BAUD_RATE);

    // Da tiempo a que un monitor serial conectado por USB nativo termine de
    // reconectarse tras un reset (el dispositivo USB se reenumera solo, con
    // este modo, en cada reinicio). Sin esto se pierden justo los primeros
    // logs — los que dicen POR QUÉ se reinició. Acotado: si no hay ningún
    // monitor conectado (el caso normal en competencia, sin laptop), no
    // bloquea más de kSerialWaitMs.
    constexpr uint32_t kSerialWaitMs = 1500;
    const uint32_t wait_start = millis();
    while (!DEBUG_LINK && (millis() - wait_start) < kSerialWaitMs) {
        delay(10);
    }
    delay(200);

    DEBUG_LINK.println("\nAthena Rover 2026 - firmware ESP32-S3 AUTONOMO (sin Raspberry Pi)");
    DEBUG_LINK.printf("[Setup] Motivo del ultimo reinicio: %s\n",
                       ResetReasonToString(esp_reset_reason()));

    // -- Selector de equipo: switch físico de 3 posiciones -------------------
    // Se queda ESPERANDO AQUÍ, antes de crear ninguna tarea (así que nada
    // puede mover motores todavía), hasta que el switch salga de la posición
    // central. Es el procedimiento normal: encender el robot con el switch
    // en 0 y recién ahí elegir equipo -- MissionTask recibe el resultado por
    // puntero y no vuelve a tocar estos pines.
    pinMode(Pins::TEAM_SWITCH_BLUE, INPUT_PULLUP);
    pinMode(Pins::TEAM_SWITCH_RED,  INPUT_PULLUP);
    delay(5);   // deja asentar la lectura tras habilitar los pull-up

    RgbLed::Setup();
    DEBUG_LINK.println("[Setup] Esperando el switch de equipo (posicion 0 = esperando)...");
    uint32_t blink_ms = millis();
    bool blink_on = false;
    for (;;) {
        const bool blue_closed = digitalRead(Pins::TEAM_SWITCH_BLUE) == LOW;
        const bool red_closed  = digitalRead(Pins::TEAM_SWITCH_RED)  == LOW;
        if (blue_closed && !red_closed) { g_myTeam = TeamColor::BLUE; break; }
        if (red_closed  && !blue_closed) { g_myTeam = TeamColor::RED;  break; }

        // Blanco tenue parpadeando: "esperando instrucción" -- ni un color de
        // equipo (todavía no hay ninguno elegido) ni apagado del todo (para
        // distinguirlo de un ESP32 que no ha arrancado).
        if ((uint32_t)(millis() - blink_ms) > 300) {
            blink_ms = millis();
            blink_on = !blink_on;
            RgbLed::SetRaw(blink_on ? 40 : 0, blink_on ? 40 : 0, blink_on ? 40 : 0);
        }
        delay(20);
    }
    RgbLed::SetRaw(0, 0, 0);
    DEBUG_LINK.printf("[Setup] Switch de equipo -> %s\n",
                       g_myTeam == TeamColor::RED ? "ROJO" : "AZUL");

